test/dummy_app/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "has many projects"], ["content", "has many test"], ["created_at", "2019-05-04 18:53:52.020559"], ["updated_at", "2019-05-04 18:53:52.020559"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "has a resume"], ["content", "has a resume test"], ["updated_at", "2019-05-04 17:13:28.042714"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_post
      @post = Post.find(params[:id])